// 🚀 ЗАДАНИЕ: Мини-калькулятор с выбором операции
// Создай программу, которая:

// 1. Содержит функцию getOperation(symbol: Char)
// Она должна возвращать анонимную функцию, которая выполняет разные действия:
// Символ	Действие
// '+'	сложение
// '-'	вычитание
// '*'	умножение
// '/'	деление (если деление на 0 → вернуть 0)
// любое другое	возвращает функцию, которая всегда возвращает -1

// 2. Содержит функцию calculate(a, b, operation)
// Которая принимает:
// два Int
// анонимную функцию вида (Int, Int) -> Int
// и выводит результат.

// 3. В main() программа должна:
// спросить у пользователя два числа
// спросить символ операции
// получить нужную анонимную функцию через getOperation()
// передать её в calculate()
// вывести результат

fun getOperation(symbol: Char):(Int,Int) -> Int {

    when(symbol){
        
        '+' -> return fun(num1:Int, num2:Int) = num1 + num2;
        '-' -> return fun(num1:Int, num2:Int) = num1 - num2;
        '*' -> return fun(num1:Int, num2:Int) = num1 * num2;
        '/' -> return fun(num1:Int, num2:Int): Int {
            if((num1 == 0) or (num2 == 0)){
                return 0;
            } else return num1 / num2;
        };
        else -> return fun(num1:Int, num2:Int) = 0;
    }
}

fun calculate(a:Int, b:Int, operation:(Int, Int) -> Int) = println(operation(a,b));

fun main (){
    print("Введите число1: ");
    var num1:Int = (readLine()?:" ").toInt();
    print("Введите число2: ");
    var num2:Int = (readLine()?:" ").toInt();
    print("Введите операцию (+,-,*,/): ");
    var operation:Char = (readLine()?:" ").single();
    calculate(10, 2, getOperation(operation));
}

